# 2. Напишите программу, которая найдёт произведение пар чисел
# списка. Парой считаем первый и последний элемент, второй 
# и предпоследний и т.д.
# *Пример:*
# - [2, 3, 4, 5, 6] =>[12,15,16]      ([2*6, 3*5, 4*4]);
# - [2, 3, 5, 6] => [12,15]   ( [2*6, 3*5]) 


a = [2, 3, 5, 6]
n = int (round((len(a) + 1)/2))
for i in range(n):
    print(a[i]*a[len(a) -i -1], end=' ')
